# Taps
tap "hudochenkov/sshpass" # For Tessera frost

# Swift Development Tools
brew "swift-format"
brew "swiftlint"

# General Development Tools
brew "just"
brew "lima" # Linux virtual machines
brew "node"
brew "pre-commit"
brew "qemu" # For Tessera frost
brew "sshpass" # For Tessera frost
brew "swtpm" # For Tessera frost
cask "utm" # Windows virtual machines

# Formatting Tools
brew "jq"

# Documentation
brew "python@3" # required for `just docs preview`

# Ghostty Test Harness
brew "cmake"
brew "ninja"
brew "zig@0.15"
